docs/pyreverse/graphviz/classes_pythermondt.transforms.gv
digraph "classes_pythermondt.transforms" {
rankdir=BT
charset="utf-8"
"pythermondt.transforms.preprocessing.ApplyLUT" [color="#F2994A", fontcolor="black", label=<{ApplyLUT|<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.utils.Compose" [color="#F2994A", fontcolor="black", label=<{Compose|transforms : Sequence[_BaseTransform]<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.preprocessing.CropFrames" [color="#F2994A", fontcolor="black", label=<{CropFrames|height : int<br ALIGN="LEFT"/>strategy : Literal['C', 'TL', 'TR', 'BL', 'BR']<br ALIGN="LEFT"/>width : int<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.augmentation.GaussianNoise" [color="#F2994A", fontcolor="black", label=<{GaussianNoise|mean : float<br ALIGN="LEFT"/>std : float<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.normalization.MaxNormalize" [color="#F2994A", fontcolor="black", label=<{MaxNormalize|eps : float<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.normalization.MinMaxNormalize" [color="#F2994A", fontcolor="black", label=<{MinMaxNormalize|eps : float<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.sampling.NonUniformSampling" [color="#F2994A", fontcolor="black", label=<{NonUniformSampling|n_samples : int<br ALIGN="LEFT"/>tau : float \| None<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.augmentation.RandomFlip" [color="#F2994A", fontcolor="black", label=<{RandomFlip|p_height : float<br ALIGN="LEFT"/>p_width : float<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.base.RandomThermoTransform" [color="#F2994A", fontcolor="black", label=<{RandomThermoTransform|<br ALIGN="LEFT"/>|}>, shape="record", style="filled"];
"pythermondt.transforms.preprocessing.RemoveFlash" [color="#F2994A", fontcolor="black", label=<{RemoveFlash|method : Literal['excitation_signal', 'max_temp', 'mean_temp_drop']<br ALIGN="LEFT"/>offset : int<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.sampling.SelectFrameRange" [color="#F2994A", fontcolor="black", label=<{SelectFrameRange|end : int \| None<br ALIGN="LEFT"/>start : int \| None<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.sampling.SelectFrames" [color="#F2994A", fontcolor="black", label=<{SelectFrames|frame_indices : list<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.preprocessing.SubtractFrame" [color="#F2994A", fontcolor="black", label=<{SubtractFrame|frame : int<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.base.ThermoTransform" [color="#F2994A", fontcolor="black", label=<{ThermoTransform|<br ALIGN="LEFT"/>|}>, shape="record", style="filled"];
"pythermondt.transforms.normalization.ZScoreNormalize" [color="#F2994A", fontcolor="black", label=<{ZScoreNormalize|eps : float<br ALIGN="LEFT"/>|forward(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.base._BaseTransform" [color="#F2994A", fontcolor="black", label=<{_BaseTransform|<br ALIGN="LEFT"/>|extra_repr(): str<br ALIGN="LEFT"/><I>forward</I>(container: DataContainer): DataContainer<br ALIGN="LEFT"/>}>, shape="record", style="filled"];
"pythermondt.transforms.augmentation.GaussianNoise" -> "pythermondt.transforms.base.RandomThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.augmentation.RandomFlip" -> "pythermondt.transforms.base.RandomThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.base.RandomThermoTransform" -> "pythermondt.transforms.base._BaseTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.base.ThermoTransform" -> "pythermondt.transforms.base._BaseTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.normalization.MaxNormalize" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.normalization.MinMaxNormalize" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.normalization.ZScoreNormalize" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.preprocessing.ApplyLUT" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.preprocessing.CropFrames" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.preprocessing.RemoveFlash" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.preprocessing.SubtractFrame" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.sampling.NonUniformSampling" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.sampling.SelectFrameRange" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.sampling.SelectFrames" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
"pythermondt.transforms.utils.Compose" -> "pythermondt.transforms.base.ThermoTransform" [arrowhead="empty", arrowtail="none"];
}
